SOAP_SFDC/Project_3_TestSuite_1-CreateNewAccount-SOAP_Request-0-FAIL.txt

Status: FAIL
Time Taken: 326
Size: 755
Timestamp: Wed Sep 09 04:13:41 IST 2020
TestStep: SOAP Request

----------------- Messages ------------------------------
[Valid HTTP Status Codes] Response status code: 500 is not in acceptable list of status codes
[Not SOAP Fault] Response is a SOAP Fault

----------------- Properties ------------------------------
Endpoint: https://login.salesforce.com/services/Soap/c/49.0
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: SOAPAction : ""
Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.5.2 (Java/12.0.1)
Host : login.salesforce.com
Accept-Encoding : gzip,deflate
Content-Length : 2712
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:enterprise.soap.sforce.com" xmlns:urn1="urn:sobject.enterprise.soap.sforce.com">
   <soapenv:Header>
      <urn:EmailHeader>
         <urn:triggerAutoResponseEmail>?</urn:triggerAutoResponseEmail>
         <urn:triggerOtherEmail>?</urn:triggerOtherEmail>
         <urn:triggerUserEmail>?</urn:triggerUserEmail>
      </urn:EmailHeader>
      <urn:PackageVersionHeader>
         <!--Zero or more repetitions:-->
         <urn:packageVersions>
            <urn:majorNumber>?</urn:majorNumber>
            <urn:minorNumber>?</urn:minorNumber>
            <urn:namespace>?</urn:namespace>
         </urn:packageVersions>
      </urn:PackageVersionHeader>
      <urn:DebuggingHeader>
         <!--Zero or more repetitions:-->
         <urn:categories>
            <urn:category>?</urn:category>
            <urn:level>?</urn:level>
         </urn:categories>
         <urn:debugLevel>?</urn:debugLevel>
      </urn:DebuggingHeader>
      <urn:LocaleOptions>
         <!--Optional:-->
         <urn:language>?</urn:language>
         <!--Optional:-->
         <urn:localizeErrors>?</urn:localizeErrors>
      </urn:LocaleOptions>
      <urn:DuplicateRuleHeader>
         <urn:allowSave>?</urn:allowSave>
         <urn:includeRecordDetails>?</urn:includeRecordDetails>
         <urn:runAsCurrentUser>?</urn:runAsCurrentUser>
      </urn:DuplicateRuleHeader>
      <urn:AllOrNoneHeader>
         <urn:allOrNone>?</urn:allOrNone>
      </urn:AllOrNoneHeader>
      <urn:StreamingEnabledHeader>
         <urn:streamingEnabled>?</urn:streamingEnabled>
      </urn:StreamingEnabledHeader>
      <urn:DisableFeedTrackingHeader>
         <urn:disableFeedTracking>?</urn:disableFeedTracking>
      </urn:DisableFeedTrackingHeader>
      <urn:AllowFieldTruncationHeader>
         <urn:allowFieldTruncation>?</urn:allowFieldTruncation>
      </urn:AllowFieldTruncationHeader>
      <urn:MruHeader>
         <urn:updateMru>?</urn:updateMru>
      </urn:MruHeader>
      <urn:AssignmentRuleHeader>
         <urn:assignmentRuleId>?</urn:assignmentRuleId>
         <urn:useDefaultRule>?</urn:useDefaultRule>
      </urn:AssignmentRuleHeader>
      <urn:SessionHeader>
         <urn:sessionId>?</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:create>
         <!--Zero or more repetitions:-->
         <urn:sObjects>
            <!--Zero or more repetitions:-->
            <urn1:fieldsToNull>?</urn1:fieldsToNull>
            <urn1:Id>?</urn1:Id>
         </urn:sObjects>
      </urn:create>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Transfer-Encoding : chunked
Cache-Control : no-cache,must-revalidate,max-age=0,no-store,private
X-B3-SpanId : 9964ee50253d8495
X-B3-Sampled : 0
X-B3-TraceId : 9964ee50253d8495
Set-Cookie : BrowserId=vgvMG_IkEeqtbEeLgutCEw; domain=.salesforce.com; path=/; expires=Wed, 08-Sep-2021 22:43:40 GMT; Max-Age=31536000
#status# : HTTP/1.1 500 Server Error
Date : Tue, 08 Sep 2020 22:43:40 GMT
Content-Type : text/xml; charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sf="urn:fault.enterprise.soap.sforce.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <soapenv:Fault>
         <faultcode>UNKNOWN_EXCEPTION</faultcode>
         <faultstring>UNKNOWN_EXCEPTION: Destination URL not reset. The URL returned from login must be set in the SforceService</faultstring>
         <detail>
            <sf:UnexpectedErrorFault xsi:type="sf:UnexpectedErrorFault">
               <sf:exceptionCode>UNKNOWN_EXCEPTION</sf:exceptionCode>
               <sf:exceptionMessage>Destination URL not reset. The URL returned from login must be set in the SforceService</sf:exceptionMessage>
            </sf:UnexpectedErrorFault>
         </detail>
      </soapenv:Fault>
   </soapenv:Body>
</soapenv:Envelope>
